# A. Project Name:  IMDb Successful Movie.
- **Student Name:** Eduardo Galindez.
- **Coding Dojo Bootcamp:** Data Science.
  - **Stack:** Data Enrichment.
- **Date:** September 29th, 2022.

# B. Project Objective
- For Part C of the project we will be practicing applying an ETL process on our previously saved movie data. Specifically, we will create a new MySQL database after preparing the data for a relational database. I will export the database to a .sql file in our repository using MySQL Workbench.

# C. Project Statement

### Specifications:

Our stakeholder wants we to take the data we have been cleaning and collecting in Parts A & B of the project, and wants me to create a MySQL database for them.

We should normalize the tables as best I can before adding them to our new database.

- Note: an important exception to their request is that they would like we to keep all of the data from the TMDB API in 1 table together (even though it will not be perfectly normalized).
- We only need to keep the imdb_id, revenue, budget, and certification columns

### Required Transformation steps:
Normalize Genre:

- Convert the single string of genres from title basics into 2 new tables.
1. title_genres: with the columns:
    - tconst
    - genre_id
2. genres:
    - genre_id
    - genre_name

Discard unnecessary information:

-For the title basics table, drop the following columns:
1. "original_title" (we will use the primary title column instead)
2. "isAdult" ("Adult" will show up in the genres so this is redundant information).
3. "titleType" (every row will be a movie).
4. "genres" and other variants of genre (genre is now represented in the 2 new tables described above.
- Do not include the title_akas table in your SQL database.
    - You have already filtered out the desired movies using this table and the remaining data is mostly nulls and not of-interest to the stakeholder.

### MySQL Database Requirements
Use sqlalchemy with pandas to execute your SQL queries inside your notebook.

Create a new database on your MySQL server and call it "movies".

Make sure to have the following tables in your "movies" database:

- title_basics
- title_ratings
- title_genres
- genres
- tmdb_data

Make sure to set a Primary Key for each table that isn't a joiner table (e.g. title_genres is a joiner table).

After creating each table, show the first 5 rows of that table using a SQL query.

Make sure to run the "SHOW TABLES" SQL query at the end of your notebook to show that all required tables have been created.

### Deliverable:

Submit a link to our github respository containing the Jupyter Notebook file.

# D. Project Development

## 1.- Libraries

In [1]:
# Libraries.
import numpy as np
import pandas as pd

from sqlalchemy.types import *
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

## 2.-  Loading Data

In [2]:
# Load Title Basics dataframe from Part A:
basics_df = pd.read_csv('./Data/title_basics_combined.csv.gz')
basics_df.head(5)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0108549,movie,West from North Goes South,West from North Goes South,0,2004.0,NaN,96,"Comedy,Mystery"
1,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000.0,NaN,86,"Musical,Romance"
2,tt0113092,movie,For the Cause,For the Cause,0,2000.0,NaN,100,"Action,Adventure,Drama"
3,tt0114447,movie,The Silent Force,The Silent Force,0,2001.0,NaN,90,Action
4,tt0115937,movie,Consequence,Consequence,0,2000.0,NaN,91,Drama

In [3]:
# Load Title Ratings dataframe from Part A:
title_ratings = pd.read_csv('./Data/title_ratings_combined.csv.gz')
title_ratings.head(5)

      tconst  averageRating  numVotes
0  tt0139422            5.7       122
1  tt0139426            4.8      1258
2  tt0139428            6.3         9
3  tt0139436            7.7        19
4  tt0139438            5.2        10

In [4]:
# Load TMDB API dataframe from Part B:
tmbd_df = pd.read_csv('./Data/tmdb_results_combined.csv.gz')
tmbd_data = tmbd_df[['imdb_id','budget', 'revenue','certifcation']]
tmbd_data.head(5)

     imdb_id      budget     revenue certifcation
0  tt0113026  10000000.0         0.0          NaN
1  tt0113092         0.0         0.0          NaN
2  tt0116391         0.0         0.0          NaN
3  tt0118694    150000.0  12854953.0           PG
4  tt0118852         0.0         0.0            R

## 3.-  Data Transformation

### 3.1.- Create genres table

In [5]:
# Check genres in Basics.
basics_df['genres']

0                   Comedy,Mystery
1                  Musical,Romance
2           Action,Adventure,Drama
3                           Action
4                            Drama
                   ...
79853                        Drama
79854    Action,Adventure,Thriller
79855                     Thriller
79856                Drama,History
79857                        Drama
Name: genres, Length: 79858, dtype: object

In [6]:
# Convert these strings into lists of strings.
basics_df['genres_split'] = basics_df['genres'].str.split(',')
basics_df

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0108549,movie,West from North Goes South,West from North Goes South,0,2004.0,NaN,96,"Comedy,Mystery","[Comedy, Mystery]"
1,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000.0,NaN,86,"Musical,Romance","[Musical, Romance]"
2,tt0113092,movie,For the Cause,For the Cause,0,2000.0,NaN,100,"Action,Adventure,Drama","[Action, Adventure, Drama]"
3,tt0114447,movie,The Silent Force,The Silent Force,0,2001.0,NaN,90,Action,[Action]
4,tt0115937,movie,Consequence,Consequence,0,2000.0,NaN,91,Drama,[Drama]
...,...,...,...,...,...,...,...,...,...,...
79853,tt9916170,movie,The Rehearsal,O Ensaio,0,2019.0,NaN,51,Drama,[Drama]
79854,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
79855,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020.0,NaN,84,Thriller,[Thriller]
79856,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History","[Drama, History]"
79857,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019.0,NaN,123,Drama,[Drama]

In [7]:
# Let's use explode to separate the list of genres into new rows
exploded_genres = basics_df.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0108549,movie,West from North Goes South,West from North Goes South,0,2004.0,NaN,96,"Comedy,Mystery",Comedy
0,tt0108549,movie,West from North Goes South,West from North Goes South,0,2004.0,NaN,96,"Comedy,Mystery",Mystery
1,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000.0,NaN,86,"Musical,Romance",Musical
1,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000.0,NaN,86,"Musical,Romance",Romance
2,tt0113092,movie,For the Cause,For the Cause,0,2000.0,NaN,100,"Action,Adventure,Drama",Action
...,...,...,...,...,...,...,...,...,...,...
79854,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Thriller
79855,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020.0,NaN,84,Thriller,Thriller
79856,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",Drama
79856,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",History
79857,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019.0,NaN,123,Drama,Drama

In [8]:
# Let's use .unique() to get the unique genres.
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [9]:
# Make integers for each genre.
genre_id = range(len(unique_genres))
genre_id

range(0, 26)

In [10]:
# Zip together the genre names & ids.
genre_map = dict(zip(unique_genres, genre_id))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [11]:
# Using pd.DataFrame and a dictionary
genres = pd.DataFrame({'genre_name': genre_map.keys(),
                         'genre_id':genre_map.values()})
genres.head(5)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

### 3.2.- Create title_genres table

In [12]:
# Lookup the new genres id.
exploded_genres['genres_split'].map(genre_map)

0         5
0        15
1        14
1        18
2         0
         ..
79854    23
79855    23
79856     7
79856    11
79857     7
Name: genres_split, Length: 149518, dtype: int64

In [13]:
# Create 'genre_id' column.
exploded_genres['genre_id'] = exploded_genres['genres_split'].map(genre_map)
exploded_genres.head(5)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split,genre_id
0,tt0108549,movie,West from North Goes South,West from North Goes South,0,2004.0,NaN,96,"Comedy,Mystery",Comedy,5
0,tt0108549,movie,West from North Goes South,West from North Goes South,0,2004.0,NaN,96,"Comedy,Mystery",Mystery,15
1,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000.0,NaN,86,"Musical,Romance",Musical,14
1,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000.0,NaN,86,"Musical,Romance",Romance,18
2,tt0113092,movie,For the Cause,For the Cause,0,2000.0,NaN,100,"Action,Adventure,Drama",Action,0

In [14]:
# Crlean and copy dataframe.
exploded_genres = exploded_genres.drop(columns=['titleType', 'titleType',
                                               'primaryTitle', 'originalTitle',
                                               'isAdult', 'startYear', 'endYear',
                                               'runtimeMinutes', 'genres', 'genres_split'])
title_genres = exploded_genres

In [15]:
# Printing the table.
title_genres

          tconst  genre_id
0      tt0108549         5
0      tt0108549        15
1      tt0113026        14
1      tt0113026        18
2      tt0113092         0
...          ...       ...
79854  tt9916190        23
79855  tt9916270        23
79856  tt9916362         7
79856  tt9916362        11
79857  tt9916538         7

[149518 rows x 2 columns]

### 3.2.- Modify basics.

In [16]:
# Discard unnecessary information in Title Basics.
basics_df = basics_df.drop(columns=['originalTitle', 'isAdult', 'endYear',
                                   'titleType', 'genres', 'genres_split'])
basics_df

          tconst                primaryTitle  startYear  runtimeMinutes
0      tt0108549  West from North Goes South     2004.0              96
1      tt0113026             The Fantasticks     2000.0              86
2      tt0113092               For the Cause     2000.0             100
3      tt0114447            The Silent Force     2001.0              90
4      tt0115937                 Consequence     2000.0              91
...          ...                         ...        ...             ...
79853  tt9916170               The Rehearsal     2019.0              51
79854  tt9916190                   Safeguard     2020.0              95
79855  tt9916270    Il talento del calabrone     2020.0              84
79856  tt9916362                       Coven     2020.0              92
79857  tt9916538         Kuambil Lagi Hatiku     2019.0             123

[79858 rows x 4 columns]

In [17]:
# Let's convert 'stratYear' to integer.
basics_df['startYear'] = basics_df['startYear'].apply(np.int64)
title_basics = basics_df.copy()
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 79858 entries, 0 to 79857
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          79858 non-null  object
 1   primaryTitle    79858 non-null  object
 2   startYear       79858 non-null  int64
 3   runtimeMinutes  79858 non-null  int64
dtypes: int64(2), object(2)
memory usage: 2.4+ MB

In [18]:
# Let's check how clean is the data so far.
title_basics.duplicated().sum()

112

In [19]:
# Drop duplicate values.
title_basics.drop_duplicates(inplace=True)

In [20]:
# Checking missing data.
title_basics.isna().sum()

tconst            0
primaryTitle      0
startYear         0
runtimeMinutes    0
dtype: int64

### 3.3.- Modify TMBD.

In [21]:
# keep the imdb_id, revenue, budget, and certification
tmbd_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2495 entries, 0 to 2494
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   imdb_id       2495 non-null   object
 1   budget        2495 non-null   float64
 2   revenue       2495 non-null   float64
 3   certifcation  794 non-null    object
dtypes: float64(2), object(2)
memory usage: 78.1+ KB

## 4.-  MySQL Database

In [22]:
# Connect to MySQL.
username = 'root' 
password = 'root' 

movies = f'mysql+pymysql://{username}:{password}@localhost/PartC_Project3'
engine = create_engine(movies, pool_size=10, max_overflow=20, pool_pre_ping=True)
engine

Engine(mysql+pymysql://root:***@localhost/PartC_Project3)

In [23]:
# Test the connection.
movies

'mysql+pymysql://root:root@localhost/PartC_Project3'

In [24]:
# Create the database.
if database_exists(movies) == False: create_database(movies)
else: print('The database already exists.')

The database already exists.

In [25]:
# Verify that the database was created.
database_exists(movies)

True

### 4.1.- Tables creation

In [26]:
# Check the dtypes of our dataframes.
print('\033[1m Title Basic Data:\033[0;0m\n', title_basics.dtypes)
print('\n\033[1m Title Ratings Data:\033[0;0m\n', title_ratings.dtypes)
print('\n\033[1m Title Genres Data:\033[0;0m\n', title_genres.dtypes)
print('\n\033[1m Genres Data:\033[0;0m\n', genres.dtypes)
print('\n\033[1m TMBD Data:\033[0;0m\n', tmbd_data.dtypes)

 Title Basic Data:
 tconst            object
primaryTitle      object
startYear          int64
runtimeMinutes     int64
dtype: object

 Title Ratings Data:
 tconst            object
averageRating    float64
numVotes           int64
dtype: object

 Title Genres Data:
 tconst      object
genre_id     int64
dtype: object

 Genres Data:
 genre_name    object
genre_id       int64
dtype: object

 TMBD Data:
 imdb_id          object
budget          float64
revenue         float64
certifcation     object
dtype: object

#### 4.1.1.- Title Basic Data

In [27]:
# Export data as csv.
title_basics.to_csv('Data/title_basics.csv.gz', compression ='gzip', index = False)

In [28]:
# Calculate max string lengths for object columns.
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()

In [29]:
# Create schema dictionary.
basics_schema = {
    'tconst': String(key_len+1),
    'primaryTitle': Text(title_len+1),
    'startYear': Integer(),
    'runTimeMinutes': Integer()}

In [30]:
# Convert to a sql table.
title_basics.to_sql('title_basics', engine, dtype = basics_schema,
                    if_exists = 'replace', index = False)

79746

In [31]:
title_basics.duplicated().sum()

0

In [32]:
# Assign primary key.
#engine.execute('ALTER TABLE movies.title_basics ADD PRIMARY KEY (`tconst`);')
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

#### 4.1.2.- Title Ratings Data

In [33]:
# Export data as csv.
title_ratings.to_csv('Data/title_ratings.csv.gz', compression ='gzip', index = False)

In [34]:
# Create schema dictionary
ratings_schema ={
    'tconst': String(key_len+1),
    'averageRating': Float(),
    'genre_id': Integer()}

In [35]:
# Convert to a sql table.
title_ratings.to_sql('title_ratings', engine, dtype = ratings_schema,
                    if_exists = 'replace', index = False)

408868

In [37]:
# Assign primary key.
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

#### 4.1.3.- Title Genres Data

In [38]:
# Export data as csv.
title_genres.to_csv('Data/title_genres.csv.gz', compression ='gzip', index = False)

In [39]:
# Create schema dictionary
title_genres_schema ={
    'tconst': String(key_len+1),
    'genre_id': Integer()}

In [40]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres', engine, dtype = title_genres_schema,
                    if_exists = 'replace', index = False)

149518

#### 4.1.4.- Genres Data

In [41]:
# Export data as csv.
genres.to_csv('Data/genres.csv.gz', compression ='gzip', index = False)

In [42]:
# Create schema dictionary
genres_schema ={
    'genre_name': String(key_len+1),
    'genre_id': Integer()}

In [43]:
# Save to sql with dtype and index=False
genres.to_sql('genres', engine, dtype = genres_schema,
                    if_exists = 'replace', index = False)

26

In [44]:
# Assign primary key.
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

#### 4.1.1.- TMDB Data

In [45]:
# Export data as csv.
tmbd_data.to_csv('Data/tmbd_data.csv.gz', compression ='gzip', index = False)

In [46]:
# Calculate max string lengths for object columns.
certification_len = tmbd_data['certifcation'].fillna('').map(len).max()

In [47]:
# Create schema dictionary
tmdb_schema ={
    'imdb_id': String(key_len+1),
    "budget": Float(),
    'revenue': Float(),
    'certifcation': String(certification_len+1)}

In [48]:
# Convert to a sql table.
tmbd_data.to_sql('tmbd_data', engine, dtype = tmdb_schema,
                    if_exists = 'replace', index = False)

2495

In [49]:
# Assign primary key.
engine.execute('ALTER TABLE tmbd_data ADD PRIMARY KEY (`imdb_id`);')

### 4.2.- Showing tables

In [50]:
# Check the communication.
q = '''
SHOW TABLES;
'''
pd.read_sql(q, engine)

  Tables_in_partc_project3
0                   genres
1             title_basics
2             title_genres
3            title_ratings
4                tmbd_data

In [51]:
q = '''
SELECT * 
FROM title_basics LIMIT 5
'''
pd.read_sql(q, engine)

      tconst                primaryTitle  startYear  runtimeMinutes
0  tt0108549  West from North Goes South       2004              96
1  tt0113026             The Fantasticks       2000              86
2  tt0113092               For the Cause       2000             100
3  tt0114447            The Silent Force       2001              90
4  tt0115937                 Consequence       2000              91

In [52]:
q = '''
SELECT * 
FROM title_ratings LIMIT 5
'''
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0139422            5.7       122
1  tt0139426            4.8      1258
2  tt0139428            6.3         9
3  tt0139436            7.7        19
4  tt0139438            5.2        10

In [53]:
q = '''
SELECT * 
FROM title_genres LIMIT 5
'''
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0108549         5
1  tt0108549        15
2  tt0113026        14
3  tt0113026        18
4  tt0113092         0

In [54]:
q = '''
SELECT * 
FROM genres LIMIT 5
'''
pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [55]:
q = '''
SELECT * 
FROM tmbd_data LIMIT 5
'''
pd.read_sql(q, engine)

     imdb_id      budget    revenue certifcation
0  tt0113026  10000000.0        0.0         None
1  tt0113092         0.0        0.0         None
2  tt0114447         0.0        0.0         None
3  tt0116391         0.0        0.0         None
4  tt0118589  22000000.0  5271670.0        PG-13

# E. Conclusions

- Data ready for future analysis and visual data exploration.